; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p3---int100n150-m25---int100c110---s32---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level19 level34)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level19 level35)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level19 level36)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level19 level37)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level34 level2 level36)
(sum level35 level2 level37)

(connected l0 l2)
(fuelcost level5 l0 l2)
(connected l0 l4)
(fuelcost level19 l0 l4)
(connected l1 l2)
(fuelcost level2 l1 l2)
(connected l1 l4)
(fuelcost level19 l1 l4)
(connected l1 l5)
(fuelcost level4 l1 l5)
(connected l2 l0)
(fuelcost level5 l2 l0)
(connected l2 l1)
(fuelcost level2 l2 l1)
(connected l2 l4)
(fuelcost level2 l2 l4)
(connected l2 l5)
(fuelcost level19 l2 l5)
(connected l3 l4)
(fuelcost level23 l3 l4)
(connected l3 l5)
(fuelcost level6 l3 l5)
(connected l4 l0)
(fuelcost level19 l4 l0)
(connected l4 l1)
(fuelcost level19 l4 l1)
(connected l4 l2)
(fuelcost level2 l4 l2)
(connected l4 l3)
(fuelcost level23 l4 l3)
(connected l5 l1)
(fuelcost level4 l5 l1)
(connected l5 l2)
(fuelcost level19 l5 l2)
(connected l5 l3)
(fuelcost level6 l5 l3)

(at t0 l1)
(fuel t0 level37)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l5 level33 level4 level37)
   deleted: (at t0 l1) (fuel t0 level37)
   added: (at t0 l5) (fuel t0 level33)
   goals met: 0 of 3
2. (drive t0 l5 l3 level27 level6 level33)
   deleted: (at t0 l5) (fuel t0 level33)
   added: (at t0 l3) (fuel t0 level27)
   goals met: 0 of 3
3. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 3
4. (drive t0 l3 l5 level21 level6 level27)
   deleted: (at t0 l3) (fuel t0 level27)
   added: (at t0 l5) (fuel t0 level21)
   goals met: 0 of 3
5. (drive t0 l5 l1 level17 level4 level21)
   deleted: (at t0 l5) (fuel t0 level21)
   added: (at t0 l1) (fuel t0 level17)
   goals met: 0 of 3
6. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 3
7. (drive t0 l1 l2 level15 level2 level17)
   deleted: (at t0 l1) (fuel t0 level17)
   added: (at t0 l2) (fuel t0 level15)
   goals met: 1 of 3
8. (drive t0 l2 l0 level10 level5 level15)
   deleted: (at t0 l2) (fuel t0 level15)
   added: (at t0 l0) (fuel t0 level10)
   goals met: 1 of 3
9. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 3
10. (drive t0 l0 l2 level5 level5 level10)
   deleted: (at t0 l0) (fuel t0 level10)
   added: (at t0 l2) (fuel t0 level5)
   goals met: 1 of 3
11. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 3
12. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 3
13. (drive t0 l2 l4 level3 level2 level5)
   deleted: (at t0 l2) (fuel t0 level5)
   added: (at t0 l4) (fuel t0 level3)
   goals met: 2 of 3
14. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 3 of 3
